CREATE TABLE courses (
                         id BIGSERIAL PRIMARY KEY,
                         name VARCHAR(255) NOT NULL,
                         description TEXT NOT NULL,
                         price NUMERIC(10, 2) NOT NULL,
                         level VARCHAR(50) NOT NULL,
                         format VARCHAR(50) NOT NULL,
                         language VARCHAR(100) NOT NULL,
                         created_at TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP
);

INSERT INTO courses (
    name,
    description,
    price,
    level,
    format,
    language
) VALUES
      (
          'Английский язык для начинающих',
          'Курс для тех, кто начинает изучать английский язык с нуля.',
          15000.00,
          'Начальный',
          'Онлайн',
          'Английский'
      ),
      (
          'Разговорный английский',
          'Практический курс для развития разговорной речи и понимания английского языка.',
          18000.00,
          'Средний',
          'Онлайн',
          'Английский'
      ),
      (
          'Английский для путешествий',
          'Полезные фразы и навыки общения для поездок и путешествий.',
          12000.00,
          'Начальный',
          'Очно',
          'Английский'
      ),
      (
          'Немецкий язык',
          'Базовый курс немецкого языка для начинающих.',
          16000.00,
          'Начальный',
          'Онлайн',
          'Немецкий'
      ),
      (
          'Испанский язык',
          'Введение в испанский язык с упором на практическое общение.',
          17000.00,
          'Начальный',
          'Очно',
          'Испанский'
      );